<div style="background: #000;
            color: #FFF;
            margin: 0px;
            margin-bottom: 10px;
            padding: 10px 0px 20px 0px;
            text-align: center; 
                ">
    <h1>Phase 3 Assessment</h1>
</div>

Name: Stanislava Hristova

Notes:

Please be sure to leave your name in the filename or in this notebook so we know whose work belongs to who. 

Start with the questions you're able to answer first and then go back to any difficult exercises.

For each section, be sure to answer (at minimum) the number of exercises needed per section.

1. Python Questions - choose **10** exercises out of 20
2. SQL Questions - choose **5** exercises out of 10
3. Data Science Questions - choose **5** exercises out of 10
4. Machine Learning Questions - choose **5** open ended questions out of 10

# Python Questions

Complete 10 out of 20.

### Exercise 1

Create a function that takes an arbitrary number of keyword arguments and returns two lists: one containing the keys and one containing the values.

In [1]:
from typing import Tuple, List, Dict

def exercise_1(**kwargs: Dict) -> Tuple[List, List]:
    l1 = []
    l2 = []
    for i,j in kwargs.items():
        #print(i,j)
        l1.append(i)
        l2.append(j)
    return l1,l2
    
exercise_1(a=0, b=1, c=2)

try:
    assert(exercise_1() == ([],[]))
    assert(isinstance(exercise_1(), Tuple))
    assert(isinstance(exercise_1()[0], List))
    assert(exercise_1(a=0) == (['a'], [0]))
    assert(exercise_1(a=0, b=1) == (['a', 'b'], [0, 1]))
    assert(exercise_1(a=0, b=1, c=2) == (['a', 'b', 'c'], [0, 1, 2]))
    print("solution is correct")
except AssertionError:
    print("solution is incorrect")

solution is correct

## Exercise 2

Given the following list, use slicing to output the second half backwards. Assign it to `exercise_2`.

Hint: start by outputting the list backwards.

In [2]:
lst = ["a", "b", "c", 1, 2, 3]

exercise_2 = lst[5:2:-1]


try:
    assert(exercise_2 == [3, 2, 1])
    print("solution is correct")
except AssertionError:
    print("solution is incorrect")

solution is correct

### Exercise 3

Create a class called `Circle` that extends the class `Shape`. `Circle` should be initialized with the same arguments as `Shape` but also take a new argument called `radius`. Override the area method so that it calculates the area of a circle using that `radius`.

The area of a circle is calculated using the following formula:

$$ A = \pi r^2$$

In [3]:
class Shape:
    def __init__(self, color):
        self.color = color
        
    def area(self):
        pass
    
class Circle(Shape):
    def __init__(self, color, radius):
        Shape.__init__(self, color)
        self.radius = radius
    
    def area(self):
        return 3.14 * self.radius ** 2

try:
    c = Circle("red", 10)
    assert(c.area() == round(314))
    print("solution is correct")
except AssertionError:
    print("solution is incorrect")

solution is correct

### Exercise 4

Create a dictionary comprehension that generates the following dictionary:
```
{0:'a', 1:'b', 2:'c', 3:'d', 4:'e'}
```

Assign the dictionary to `exercise_4`.

In [4]:
v = ['a', 'b', 'c', 'd', 'e']
exercise_4 = {k:v for k,v in enumerate(v)}

try:
    assert(exercise_4 == {0:'a', 1:'b', 2:'c', 3:'d', 4:'e'})
    print("solution is correct")
except AssertionError:
    print("solution is incorrect")

solution is correct

### Exercise 5.

Create a lambda expression that takes `a`, `b`, `c` and `x` and calculates the following: 

$$  \text{f} = \frac{2ax^4 + 2bx^3 -2cx^2}{2x^2} $$

Bonus points: Can you notice the issue you might have with this equation?

In [7]:
#no - come back and fix

f = lambda a,b,c,x: 2*a*(x**4) + 2*b*(x**3) - 2*c*(x**2) / 2*(x^2)
f

print(f(0,0,0,2))
print(f(2,1,0,2))
print(f(5,0,0,2))
print(f(5,3,4,2))

try:
    assert(f(0,0,0,2) == 0)
    assert(f(2,1,0,2) == 10)
    assert(f(5,0,0,2) == 20)
    assert(f(5,3,4,2) == 22)
    print("solution is correct")
except:
    print("solution is incorrect")

0.0
80.0
160.0
208.0
solution is incorrect

bonus answer:

### Exercise 6.

Create a function that outputs a list of all the even numbers from 1 to 500 that are also divisible by 3, 5 **OR** 7.

note: there is an **"or"** in the statement above.

In [8]:
from hashlib import sha256

def exercise_6():
    l = []
    for num in range(1,501):
        if num %2 == 0:
            l.append(num)
    l1=[]
    for i in l:
        if i%3 == 0 or i%5 == 0 or i%7 == 0:
            l1.append(i)
    return l1

exercise_6()

try:
    assert(sha256(str(exercise_6()).encode('utf-8')).hexdigest() == "a734160e2cde76ca5e8096e376f05d6c4819a06a23a7e03b1d79b348b4558ba6" )
    print("solution is correct")
except AssertionError:
    print("solution is incorrect")

solution is correct

### Exercise 7.

Add a method called `from_full_name` to the following function so that we are able to create an instance of the class by passing the a full name (string of first and last name separated by a space). Do not change anything from the try/except block below. Then create an instance using that method.

In [9]:
import inspect # this is necessary for checking your answer - ignore

class Person:
    def __init__(self, first_name= None, last_name=None):
        self.first_name = first_name
        self.last_name = last_name
    
    @classmethod
    def from_full_name(cls, full_name):
        first_name, last_name = full_name.split(' ')
        return Person(first_name, last_name)

try:
    p = Person.from_full_name("A P")
    assert(getattr(p, 'first_name', None) == "A")
    assert(getattr(p, 'last_name', None) == "P")
    assert(inspect.ismethod(Person.from_full_name) and Person.from_full_name.__self__ is Person)
    print("solution should probably be correct (not guaranteed)")
except AssertionError:
    print("solution is incorrect")

solution should probably be correct (not guaranteed)

### Exercise 8

The Towers of Hanoi is a mathematical puzzle whose solution can be found using recursion. There are three pegs which can hold stacks of disks of different diameters. A larger disk may never be stacked on top of a smaller. Starting with n disks on one peg, they must be moved to another peg one at a time.

Write a function that calculates the smallest number of steps to move the stack.



To calculate this, use the following function:


$$ \begin{equation*}
\text{hanoi}(n) = \left\{
        \begin{array}{ll}
            1 & \quad \text{if} \, n = 1 \\
            2 * \text{hanoi}(n-1) + 1 & \quad \text{if} \, n > 1
        \end{array}
    \right.
\end{equation*} $$

In [10]:
def hanoi(n):
    if n==1:
        return 1
    elif n>1:
        return 2*hanoi(n-1)+1
    
try:
    assert(hanoi(1) == 1)
    assert(hanoi(4) == 15)
    assert(hanoi(15) == 32767)
    print("solution is correct")
except AssertionError:
    print("solution is incorrect")

solution is correct

### Exercise 9

Create a function that executes in $O(n^2)$.

In [11]:
letters = ["a", "b", "c"]
numbers = ["1", "2", "3"]

for i in letters:
    for j in numbers:
        print(i, j)

a 1
a 2
a 3
b 1
b 2
b 3
c 1
c 2
c 3

### Exercise 10 

Implement a binary search algorithm in python. Use it to search through the given list for `10`.**

In [12]:
given = [-10, -9, -8, -7, -6, -5, -4, -3, -2, -1, 0]

assert(sorted(given) == given)

In [13]:
from typing import List

def binary_search(l: List = given, s: int = 0) -> int:
    low = 0
    high = len(given) - 1
    mid = 0
 
    while low <= high:
 
        mid = (high + low) // 2
        if given[mid] < s:
            low = mid + 1
            
        elif given[mid] > s:
            high = mid - 1

        else:
            return mid

    return -1
    
binary_search()
binary_search(s=2)
try:
    assert(binary_search() == 10)
    assert(binary_search(s=2) == -1)
    assert(binary_search(s=-5) == 5)
    print("test passed")
except AssertionError as e:
    print("test failed")

test passed

### Exercise 11 

Fix the following code so the function calls work.

In [14]:
class BinaryTree:
    def __init__(self, data):
        self.left = None
        self.right = None
        self.data = data

    def add(self, data):
        if data > self.data:
            if self.right is None:
                self.right = BinaryTree(data)
            else:
                self.right.add(data)
        if data < self.data:
            if self.left is None:
                self.left = BinaryTree(data)
            else:
                self.left.add(data)
        
    def print(self):
        if self.left:
            self.left.print()
        print(self.data)
        if self.right:
            self.right.print()  
            
bt = BinaryTree(5)
bt.add(7)
bt.add(8)
bt.add(3)
bt.add(4)
bt.print()
# if your solution is correct,
# you will see all the values [3,4,5,7,8] printed

3
4
5
7
8

### Exercise 12

Write a class that implements a stack. Use any method of your choosing. Your stack must have the following three methods: `push`, `pop`, `peek` (returns next value to be popped).

In [15]:
class Stack:
    def __init__(self):
        self.stack = []
        
    def push(self, val):
        self.stack.append(val)
        
    def pop(self):
        return self.stack.pop()
    
    def print(self):
        print(self.stack)
        
    def peek(self):
        return self.stack[-1]
    
# use the following to test your code    
try:
    s = Stack()
    s.push(3)
    s.push(4)
    s.push(5)
    assert(s.pop() == 5)
    assert(s.peek() == 4)
    print("test passed")
except AssertionError:
    print("test failed.")

test passed

### Exercise 13

Write a python function that calculates the expected value of the following dictionary containing outcomes (in dollars) and their probabilities.

Let $X$ by a random variable with $k$ number of finite outcomes $x_1, x_2,...,x_k$ occurring with probability $p_1, p_1,...,p_k$, respectively. The **expectation** of $X$ is defined as:
$$ E[X] = \sum_{i=1}^{k}{x_i p_i} = x_1p_1 + x_2p_2 + ... + x_kp_k$$

In [ ]:
# os are outcomes
os = [-20.0, -10.0, 0.0, 10, 20]
# ps are probabilities respectively
ps = [0.20, 0.20, 0.20, 0.20, 0.20]

def expected_value(outcomes = os, probabilities = ps):
    pass

try:
    assert(expected_value() == 0.0)
    print("test passed.")
except AssertionError:
    print("test failed.")

### Exercise 14

Create a dataclass called Vector that contains:
* two attributes `x` and `y`
* a method that overrides the addition operator so you can add two points together
* a method called `distance` that calculates the distance between the two points using the distance formula we saw in class:

$$ \text{distance} = \sqrt{(x_2-x_1)^{2} + (y_2-y_1)^{2} } $$

In [ ]:
from typing import List
from dataclasses import dataclass

@dataclass
class Vector:
    pass
    
try:
    v_1 = Vector(-4,-4)
    v_2 = Vector(3,4)
    assert(v_1 + v_2 == Vector(x=-1,y=0))
    # this is basically calculating a 
    # 3-4-5 right triangle
    v_1 = Vector(0,0)
    v_2 = Vector(3,4)
    assert(v_1.distance(v_2) == 5)
    assert(v_2.distance(v_1) == 5)
    print("tests passed")
except AssertionError:
    print("test failed.")

### Exercise 15

Create a generator function that takes a string and returns the next character of the string each time it yields a value.

In [238]:
import types

# this is needed for test; do not change
s = "really long string that has a lot of characters in it"

def exercise_15(string=s):
    for i in s:
        yield i

try:
    gen = exercise_15()
    assert(isinstance(gen, types.GeneratorType))
    assert((e:= next(gen)) == 'r')
    assert(list(gen) == list(s)[1:])
    print("test passed")
except:
    print("test failed")

test passed

### Exercise 16

Create a decorator function that when decorating a function, prints: 
```
***STARTING FUNCTION***
```
before the function call and 
```
***ENDING FUNCTION CALL***
```
after calling the function.

For bonus points, print the time taken to call the function **and** what the return values are.

In [255]:
from time import time

def decorator_function(func):
    def wrap_func(*args, **kwargs):
        print("***STARTING FUNCTION***")
        t1 = time()
        result = func(*args, **kwargs)
        t2 = time()
#         print(f'Function {func.__name__} executed in {(t2-t1):.8f}s')
#         print(f'{t2-t1}')
        print('***ENDING FUNCTION CALL***')
        return result
        
    return wrap_func

        
@decorator_function
def func(n):
    #time.sleep(1)
    return n**2

func(100_000_000_000)

***STARTING FUNCTION***
***ENDING FUNCTION CALL***

10000000000000000000000

### Exercise 17

Show an example of currying functions: two regular functions and a third that uses the previous two.

In [18]:
def multiply(a,b):
    return a*b

def add(a,b):
    return a+b

multiply(1,2)
add(1,2)

3

In [19]:
def do_both(a,b):
    x = add(multiply(a,b),b)
    return x

do_both(1,2)

4

### Exercise 18

Create a function that takes a list of integers and calculates the mean. Use the following formula for calculating averages and not any `mean`/`average` method.

$$ \mu = {\frac {1}{n}}\sum _{i=1}^{n}a_{i}={\frac {a_{1}+a_{2}+\cdots +a_{n}}{n}}$$

In [ ]:
example_list = [1,2,3,4,5,6,7,8,9]

### Exercise 19

Create a function that uses your favorite standard library module.

### Exercise 20

You are tasked with building a data pipeline that scrapes data, stores it in sql, processes it in numpy/pandas (think exploratory analysis and data cleanup) and uses the data in a K-Means clustering. Write out the steps you would take to complete this task, what the structure of your project would look like and what considerations should be made (e.g. what might become an issue, what decisions must we make, what steps would need to be done first, etc).

# SQL

### Exercise 1

Fix the `CREATE` SQL query in the code below to create the following table
```
table: Employees
+----+------+-----+--------+
| Id | Name | Age | Salary |
+----+------+-----+--------+
Id is an integer primary key
Name is a not null varchar
Age is a not null integer
Salary is a not null integer
```

In [256]:
#come back to fix
import sqlite3

sql_commands = \
"""
DROP TABLE IF EXISTS Employee;

CREATE TABLE Employee (
 Id INTEGER NOT NULL PRIMARY KEY,
 Name VARCHAR(30) NOT NULL
 Age INTEGER
 Salary INTEGER
);

INSERT INTO Employee (Id, Name, Age, Salary) values ('1', 'Employee 1', '29', '100');
INSERT INTO Employee (Id, Name, Age, Salary) values ('2', 'Employee 2', '41', '200');
INSERT INTO Employee (Id, Name, Age, Salary) values ('3', 'Employee 3', '23', '300');

"""
db = sqlite3.connect('phase-3-assessment.db')
cursor = db.cursor()
cursor.executescript(sql_commands)
db.commit()
db.close()

OperationalError: near "Age": syntax error

In [ ]:
# use this function for your answers.
def with_conn(statement):
    conn = sqlite3.connect('phase-3-assessment.db')
    with conn:
        cur = conn.cursor()
        cur.execute(statement)
        result = cur.fetchall()
        return result

In [ ]:
with_conn('SELECT * FROM Employee')


### Exercise 2

Write a SQL query to get the highest salary from the Employee table.
```
+----+--------+
| Id | Salary |
+----+--------+
| 1  | 100    |
| 2  | 200    |
| 3  | 300    |
+----+--------+
```
For example, given the above Employee table, the query should return 300 as the second highest salary. If there is no second highest salary, then the query should return null.
```
+---------------------+
| HighestSalary |
+---------------------+
| 300                 |
+---------------------+
```

In [21]:
#second highest or highest? confusing prompt...
import sqlite3

sql_commands = \
"""
DROP TABLE IF EXISTS Employee;

CREATE TABLE Employee (
 Id INTEGER NOT NULL PRIMARY KEY,
 Salary INTEGER NOT NULL
);

INSERT INTO Employee (Id, Salary) values ('1', '100');
INSERT INTO Employee (Id, Salary) values ('2', '200');
INSERT INTO Employee (Id, Salary) values ('3', '300');

"""
db = sqlite3.connect('phase-3-assessment.db')
cursor = db.cursor()
cursor.executescript(sql_commands)
db.commit()
db.close()

In [22]:
# use this function for your answers.
def with_conn(statement):
    conn = sqlite3.connect('phase-3-assessment.db')
    with conn:
        cur = conn.cursor()
        cur.execute(statement)
        result = cur.fetchall()
        return result

In [23]:
with_conn('SELECT * FROM Employee')

[(1, 100), (2, 200), (3, 300)]

In [24]:
with_conn('SELECT max(Salary) FROM Employee')   #this returns the highest salary

[(300,)]

In [25]:
with_conn('SELECT MAX(Salary) FROM Employee WHERE Salary NOT IN (SELECT MAX(Salary) FROM Employee)')  #this returns second highest salary

[(200,)]

### Exercise 3

Write the SQL query/queries that updates the following table so that any user that has an email address is verified.
```
table: User
+----+----------+---------+----------+
| id | username |  email  | verified |
+----+----------+---------+----------+
| 1  | platano  | p@pm.me | false    |
| 2  | unknown  | u@pm.me | false    |
| 3  | malcolm  |         | false    |
+----+----------+---------+----------+
```

In [26]:
import sqlite3

sql_commands = \
"""
DROP TABLE IF EXISTS User;

CREATE TABLE User (
 id INTEGER NOT NULL PRIMARY KEY,
 username VARCHAR(30) NOT NULL,
 email VARCHAR(30),
 verified BOOL
);

INSERT INTO User (username, email, verified) VALUES ('platano', 'p@pm.me', 'false');
INSERT INTO User (username, email, verified) VALUES ('unknown', 'u@pm.me', 'false');
INSERT INTO User (username, verified) VALUES ('malcolm', 'false');

"""
db = sqlite3.connect('phase-3-assessment.db')
cursor = db.cursor()
cursor.executescript(sql_commands)
db.commit()
db.close()

In [27]:
# use this function for your answers.
def with_conn(statement):
    conn = sqlite3.connect('phase-3-assessment.db')
    with conn:
        cur = conn.cursor()
        cur.execute(statement)
        result = cur.fetchall()
        return result

In [28]:
with_conn('SELECT * FROM User')

[(1, 'platano', 'p@pm.me', 'false'),
 (2, 'unknown', 'u@pm.me', 'false'),
 (3, 'malcolm', None, 'false')]

In [29]:
with_conn('UPDATE User SET verified="true" WHERE email IS NOT NULL')

[]

In [30]:
with_conn('SELECT * FROM User')

[(1, 'platano', 'p@pm.me', 'true'),
 (2, 'unknown', 'u@pm.me', 'true'),
 (3, 'malcolm', None, 'false')]

### Exercise 4

Write the SQL query/queries that deletes rows from the following table if the user that has no email.
```
table: User
+----+----------+---------+----------+
| id | username |  email  | verified |
+----+----------+---------+----------+
| 1  | platano  | p@pm.me | false    |
| 2  | unknown  | u@pm.me | false    |
| 3  | malcolm  |         | false    |
+----+----------+---------+----------+
```

In [263]:
import sqlite3

sql_commands = \
"""
DROP TABLE IF EXISTS User;

CREATE TABLE User (
 id INTEGER NOT NULL PRIMARY KEY,
 username VARCHAR(30) NOT NULL,
 email VARCHAR(30),
 verified BOOL
);

INSERT INTO User (username, email, verified) VALUES ('platano', 'p@pm.me', 'false');
INSERT INTO User (username, email, verified) VALUES ('unknown', 'u@pm.me', 'false');
INSERT INTO User (username, verified) VALUES ('malcolm', 'false');

"""
db = sqlite3.connect('phase-3-assessment.db')
cursor = db.cursor()
cursor.executescript(sql_commands)
db.commit()
db.close()

In [264]:
# use this function for your answers.
def with_conn(statement):
    conn = sqlite3.connect('phase-3-assessment.db')
    with conn:
        cur = conn.cursor()
        cur.execute(statement)
        result = cur.fetchall()
        return result

In [265]:
with_conn('SELECT * FROM User')

[(1, 'platano', 'p@pm.me', 'false'),
 (2, 'unknown', 'u@pm.me', 'false'),
 (3, 'malcolm', None, 'false')]

In [266]:
with_conn('DELETE FROM User WHERE email IS NULL')

[]

In [267]:
with_conn('SELECT * FROM User')

[(1, 'platano', 'p@pm.me', 'false'), (2, 'unknown', 'u@pm.me', 'false')]

### Exercise 5

Write the SQL query/queries that inserts 5 students into the following table. Use a select statement to demonstrate that it works.
```
table: User
+----+----------+---------+----------+
| id | username |  email  | verified |
+----+----------+---------+----------+
| 1  | platano  | p@pm.me | false    |
| 2  | unknown  | u@pm.me | false    |
| 3  | malcolm  |         | false    |
+----+----------+---------+----------+
```

In [268]:
import sqlite3

sql_commands = \
"""
DROP TABLE IF EXISTS Student;

CREATE TABLE Student (
 id INTEGER NOT NULL PRIMARY KEY,
 name VARCHAR(30) NOT NULL,
 class VARCHAR(30) NOT NULL,
 email VARCHAR(30),
 passing BOOL NOT NULL
);
"""
db = sqlite3.connect('phase-3-assessment.db')
cursor = db.cursor()
cursor.executescript(sql_commands)
db.commit()
db.close()

In [269]:
# use this function for your answers.
def with_conn(statement):
    conn = sqlite3.connect('phase-3-assessment.db')
    with conn:
        cur = conn.cursor()
        cur.execute(statement)
        result = cur.fetchall()
        return result

In [279]:
with_conn('INSERT INTO Student \
        VALUES(null,"name 5", "class 3", "llmmkk.bb.org", "false" )')   #run this 5 times for each new student

[]

In [280]:
with_conn('SELECT * FROM Student')

[(1, 'name 1', 'class 1', 'poop.me.me', 'true'),
 (2, 'name 2', 'class 2', 'akkmhop.me.com', 'true'),
 (3, 'name 3', 'class 2=1', 'aaaahop.me.org', 'true'),
 (4, 'name 4', 'class 2', 'blah.me.org', 'false'),
 (5, 'name 5', 'class 3', 'llmmkk.bb.org', 'false')]

### Exercise 6

Insert rows into the Student table using the rows in the People table.

hint: Use a `SELECT` subquery.
```
table: Student
+----+----------+---------+----------+
| id | username |  email  | verified |
+----+----------+---------+----------+
| 1  | platano  | p@pm.me | false    |
| 2  | unknown  | u@pm.me | false    |
| 3  | malcolm  |         | false    |
+----+----------+---------+----------+
```

In [281]:
import sqlite3

sql_commands = \
"""
DROP TABLE IF EXISTS Student;
DROP TABLE IF EXISTS People;

CREATE TABLE Student (
 id INTEGER NOT NULL PRIMARY KEY,
 name VARCHAR(30) NOT NULL,
 class VARCHAR(30),
 email VARCHAR(30),
 passing BOOL
);

Create TABLE People (
 id INTEGER NOT NULL PRIMARY KEY,
 name VARCHAR(30) NOT NULL,
 email VARCHAR(30) NOT NULL
);

INSERT INTO People (name, email) VALUES ('platano man', 'p@pm.me');
INSERT INTO People (name, email) VALUES ('unknown person', 'u@pm.me');

"""
db = sqlite3.connect('phase-3-assessment.db')
cursor = db.cursor()
cursor.executescript(sql_commands)
db.commit()
db.close()

In [282]:
# use this function for your answers.
def with_conn(statement):
    conn = sqlite3.connect('phase-3-assessment.db')
    with conn:
        cur = conn.cursor()
        cur.execute(statement)
        result = cur.fetchall()
        return result

In [283]:
with_conn('SELECT * FROM Student')

[]

In [284]:
with_conn('SELECT * FROM People')

[(1, 'platano man', 'p@pm.me'), (2, 'unknown person', 'u@pm.me')]

In [286]:
with_conn('SELECT id,name,email FROM People')

[(1, 'platano man', 'p@pm.me'), (2, 'unknown person', 'u@pm.me')]

In [292]:
# with_conn('INSERT INTO Student \
#         VALUES(SELECT p.id,p.name,p.email FROM People p, Student s WHERE s.id=p.id)')

### Exercise 7

Suppose that a website contains two tables, the Customers table and the Orders table. Write a SQL query to find all customers who never order anything.
```
Table: Customers.

+----+-------+
| Id | Name  |
+----+-------+
| 1  | Joe   |
| 2  | Henry |
| 3  | Sam   |
| 4  | Max   |
+----+-------+

Table: Orders.

+----+------------+
| Id | CustomerId |
+----+------------+
| 1  | 3          |
| 2  | 1          |
+----+------------+
```
Using the above tables as example, return the following:
```
+-----------+
| Customers |
+-----------+
| Henry     |
| Max       |
+-----------+
```

In [218]:
import sqlite3

sql_commands = \
"""
PRAGMA foreign_keys = ON;

DROP TABLE IF EXISTS Customers;
DROP TABLE IF EXISTS Orders;

CREATE TABLE Customers (
 Id INTEGER NOT NULL PRIMARY KEY,
 Name NVARCHAR(255)
);

CREATE TABLE Orders (
 Id INTEGER NOT NULL PRIMARY KEY,
 CustomerId INTEGERY NOT NULL,
 FOREIGN KEY(CustomerId) REFERENCES Customers(Id)
);

INSERT INTO Customers (Id, Name) VALUES ('1', 'Joe');
INSERT INTO Customers (Id, Name) VALUES ('2', 'Henry');
INSERT INTO Customers (Id, Name) VALUES ('3', 'Sam');
INSERT INTO Customers (Id, Name) VALUES ('4', 'Max');
INSERT INTO Orders (Id, CustomerId) VALUES ('1', '3');
INSERT INTO Orders (Id, CustomerId) VALUES ('2', '1');
"""
db = sqlite3.connect('phase-3-assessment.db')
cursor = db.cursor()
cursor.executescript(sql_commands)
db.commit()
db.close()

IntegrityError: FOREIGN KEY constraint failed

In [219]:
# use this function for your answers.
def with_conn(statement):
    conn = sqlite3.connect('phase-3-assessment.db')
    with conn:
        cur = conn.cursor()
        cur.execute(statement)
        result = cur.fetchall()
        return result

In [220]:
with_conn('SELECT * FROM Customers')

[(1, 'Joe'), (2, 'Henry'), (3, 'Sam'), (4, 'Max')]

In [221]:
with_conn('SELECT * FROM Orders')

[(1, 3), (2, 1)]

In [222]:
with_conn('SELECT Name FROM Customers WHERE Name NOT IN (SELECT c.Name FROM Customers c, Orders o WHERE o.CustomerId= c.Id)')

[('Henry',), ('Max',)]

### Exercise 8

Table `my_numbers` contains many numbers in column `num` including duplicated ones as well as a value in corresponding column `val`.
Can you write a SQL query to find the biggest `num` for all rows that have val `A`.
```
+---+---+
|num|val|
+---+---+
| 8 | A |
| 7 | A |
| 3 | A |
| 3 | A |
| 1 | B |
| 4 | B |
| 5 | B |
| 6 | B |
```
For the sample data above, your query should return the following result:
```
+---+---+
|num|val|
+---+---+
| 8 | A |
```

In [58]:
import sqlite3

sql_commands = \
"""
DROP TABLE IF EXISTS my_numbers;

CREATE TABLE my_numbers (
 id INTEGER NOT NULL PRIMARY KEY,
 num INTEGER NOT NULL,
 val VARCHAR(1) NOT NULL
);

INSERT INTO my_numbers (num, val) VALUES ('8', 'A');
INSERT INTO my_numbers (num, val) VALUES ('7', 'A');
INSERT INTO my_numbers (num, val) VALUES ('3', 'A');
INSERT INTO my_numbers (num, val) VALUES ('3', 'A');
INSERT INTO my_numbers (num, val) VALUES ('1', 'B');
INSERT INTO my_numbers (num, val) VALUES ('4', 'B');
INSERT INTO my_numbers (num, val) VALUES ('5', 'B');
INSERT INTO my_numbers (num, val) VALUES ('6', 'B');
"""
db = sqlite3.connect('phase-3-assessment.db')
cursor = db.cursor()
cursor.executescript(sql_commands)
db.commit()
db.close()

In [59]:
# use this function for your answers.
def with_conn(statement):
    conn = sqlite3.connect('phase-3-assessment.db')
    with conn:
        cur = conn.cursor()
        cur.execute(statement)
        result = cur.fetchall()
        return result

In [60]:
with_conn('SELECT * FROM my_numbers;')

[(1, 8, 'A'),
 (2, 7, 'A'),
 (3, 3, 'A'),
 (4, 3, 'A'),
 (5, 1, 'B'),
 (6, 4, 'B'),
 (7, 5, 'B'),
 (8, 6, 'B')]

In [62]:
with_conn('SELECT max(num),val FROM my_numbers WHERE val="A";')

[(8, 'A')]

### Exercise 9

Table `numbers` contains many numbers in column `num`
Can you write a SQL query that sums the `num` column for all rows that have vals that are `B`.
```
+---+---+
|num|val|
+---+---+
| 8 | A |
| 7 | A |
| 3 | A |
| 3 | A |
| 1 | B |
| 4 | B |
| 5 | B |
| 6 | B |
```
For the sample data above, your query should return the following result:
```
+---+---+
|num|val|
+---+---+
| 8 | A |
```

In [63]:
#isn't the promp output confusing, it shows 'A'? I got 16 for the sum of 'B'.

import sqlite3

sql_commands = \
"""
DROP TABLE IF EXISTS numbers;

CREATE TABLE numbers (
 id INTEGER NOT NULL PRIMARY KEY,
 num INTEGER NOT NULL,
 val VARCHAR(1) NOT NULL
);

INSERT INTO numbers (num, val) VALUES ('8', 'A');
INSERT INTO numbers (num, val) VALUES ('7', 'A');
INSERT INTO numbers (num, val) VALUES ('3', 'A');
INSERT INTO numbers (num, val) VALUES ('3', 'A');
INSERT INTO numbers (num, val) VALUES ('1', 'B');
INSERT INTO numbers (num, val) VALUES ('4', 'B');
INSERT INTO numbers (num, val) VALUES ('5', 'B');
INSERT INTO numbers (num, val) VALUES ('6', 'B');
"""
db = sqlite3.connect('phase-3-assessment.db')
cursor = db.cursor()
cursor.executescript(sql_commands)
db.commit()
db.close()

In [64]:
# use this function for your answers.
def with_conn(statement):
    conn = sqlite3.connect('phase-3-assessment.db')
    with conn:
        cur = conn.cursor()
        cur.execute(statement)
        result = cur.fetchall()
        return result

In [65]:
with_conn('SELECT * FROM numbers;')

[(1, 8, 'A'),
 (2, 7, 'A'),
 (3, 3, 'A'),
 (4, 3, 'A'),
 (5, 1, 'B'),
 (6, 4, 'B'),
 (7, 5, 'B'),
 (8, 6, 'B')]

In [66]:
with_conn('SELECT sum(num),val FROM my_numbers WHERE val="B";')

[(16, 'B')]

### Exercise 10

```
Table: Customers

+---------------------+---------+
| Column Name         | Type    |
+---------------------+---------+
| customer_id         | int     |
| customer_name       | varchar |
+---------------------+---------+
customer_id is the primary key for this table.
customer_name is the name of the customer.

 

Table: Orders

+---------------+---------+
| Column Name   | Type    |
+---------------+---------+
| order_id      | int     |
| customer_id   | int     |
| product_name  | varchar |
+---------------+---------+
order_id is the primary key for this table.
customer_id is the id of the customer who bought the product "product_name".
```

Write an SQL query to report the customer_id and customer_name of customers who bought products "A", "B" but did not buy the product "C" since we want to recommend them buy this product.

Return the result table ordered by customer_id.

The query result format is in the following example.

 
```
Customers table:
+-------------+---------------+
| customer_id | customer_name |
+-------------+---------------+
| 1           | Daniel        |
| 2           | Diana         |
| 3           | Elizabeth     |
| 4           | Jhon          |
+-------------+---------------+

Orders table:
+------------+--------------+---------------+
| order_id   | customer_id  | product_name  |
+------------+--------------+---------------+
| 10         |     1        |     A         |
| 20         |     1        |     B         |
| 30         |     1        |     D         |
| 40         |     1        |     C         |
| 50         |     2        |     A         |
| 60         |     3        |     A         |
| 70         |     3        |     B         |
| 80         |     3        |     D         |
| 90         |     4        |     C         |
+------------+--------------+---------------+

Result table:
+-------------+---------------+
| customer_id | customer_name |
+-------------+---------------+
| 3           | Elizabeth     |
+-------------+---------------+
Only the customer_id with id 3 bought the product A and B but not the product C.
```

In [223]:
import sqlite3

sql_commands = \
"""
DROP TABLE IF EXISTS Customers;
DROP TABLE IF EXISTS Orders;

CREATE TABLE Customers (
 customer_id INTEGER NOT NULL PRIMARY KEY,
 customer_name NVARCHAR(30)
);

CREATE TABLE Orders (
 order_id INTEGER NOT NULL PRIMARY KEY,
 customer_id INTEGER NOT NULL,
 product_name VARCHAR(30)
);

INSERT INTO Customers (customer_id, customer_name ) VALUES ('1', 'Daniel');
INSERT INTO Customers (customer_id, customer_name ) VALUES ('2', 'Diana');
INSERT INTO Customers (customer_id, customer_name ) VALUES ('3', 'Elizabeth');
INSERT INTO Customers (customer_id, customer_name ) VALUES ('4', 'Jhon');

INSERT INTO Orders (order_id, customer_id, product_name) VALUES ('10', '1', 'A');
INSERT INTO Orders (order_id, customer_id, product_name) VALUES ('20', '1', 'B');
INSERT INTO Orders (order_id, customer_id, product_name) VALUES ('30', '1', 'D');
INSERT INTO Orders (order_id, customer_id, product_name) VALUES ('40', '1', 'C');
INSERT INTO Orders (order_id, customer_id, product_name) VALUES ('50', '2', 'A');
INSERT INTO Orders (order_id, customer_id, product_name) VALUES ('60', '3', 'A');
INSERT INTO Orders (order_id, customer_id, product_name) VALUES ('70', '3', 'B');
INSERT INTO Orders (order_id, customer_id, product_name) VALUES ('80', '3', 'D');
INSERT INTO Orders (order_id, customer_id, product_name) VALUES ('90', '4', 'C');
"""

db = sqlite3.connect('phase-3-assessment.db')
cursor = db.cursor()
cursor.executescript(sql_commands)
db.commit()
db.close()

In [224]:
# use this function for your answers.
def with_conn(statement):
    conn = sqlite3.connect('phase-3-assessment.db')
    with conn:
        cur = conn.cursor()
        cur.execute(statement)
        result = cur.fetchall()
        return result

In [225]:
with_conn("SELECT * FROM Customers;")

[(1, 'Daniel'), (2, 'Diana'), (3, 'Elizabeth'), (4, 'Jhon')]

In [226]:
with_conn("SELECT * FROM Orders;")

[(10, 1, 'A'),
 (20, 1, 'B'),
 (30, 1, 'D'),
 (40, 1, 'C'),
 (50, 2, 'A'),
 (60, 3, 'A'),
 (70, 3, 'B'),
 (80, 3, 'D'),
 (90, 4, 'C')]

In [230]:
with_conn("SELECT customer_id FROM Orders where product_name='A' or product_name='B';")

[(1,), (1,), (2,), (3,), (3,)]

# Data Science
Complete 5 out of 10

In [67]:
import numpy as np
import pandas as pd
import matplotlib.pyplot as plt
import seaborn as sns
# you can optionally choose to import and use bokeh

### Exercise 1

Create an array that contains the values of $y$ for each of the $x$ values ranging from 0 to 100. Then chart the relationship.

$$ y = 25x+10  $$

In [69]:
x = np.arange(1,101)
y = 25*x + 10
y

array([  35,   60,   85,  110,  135,  160,  185,  210,  235,  260,  285,
        310,  335,  360,  385,  410,  435,  460,  485,  510,  535,  560,
        585,  610,  635,  660,  685,  710,  735,  760,  785,  810,  835,
        860,  885,  910,  935,  960,  985, 1010, 1035, 1060, 1085, 1110,
       1135, 1160, 1185, 1210, 1235, 1260, 1285, 1310, 1335, 1360, 1385,
       1410, 1435, 1460, 1485, 1510, 1535, 1560, 1585, 1610, 1635, 1660,
       1685, 1710, 1735, 1760, 1785, 1810, 1835, 1860, 1885, 1910, 1935,
       1960, 1985, 2010, 2035, 2060, 2085, 2110, 2135, 2160, 2185, 2210,
       2235, 2260, 2285, 2310, 2335, 2360, 2385, 2410, 2435, 2460, 2485,
       2510])

### Exercise 2

Create a 2-dimensional array that contains the numbers from 1 to 20 with even numbers in the first column and odd numbers in the second.

In [200]:
arr = np.arange(1, 21).reshape(10,2)
arr
arr[:, [1, 0]] = arr[:, [0, 1]] #swapping the 2 columns by index
arr

array([[ 2,  1],
       [ 4,  3],
       [ 6,  5],
       [ 8,  7],
       [10,  9],
       [12, 11],
       [14, 13],
       [16, 15],
       [18, 17],
       [20, 19]])

### Exercise 3

Create an array with random numbers between 0 and 1.

In [98]:
 
arr = np.random.rand(7)
arr

array([0.97659711, 0.36930241, 0.72433186, 0.33598389, 0.92072578,
       0.02618152, 0.26336723])

### Exercise 4

Create an array that contains 10 numbers. All of them between 0 and 5. Then add that to an array that contains the numbers from 5 to 10.

In [202]:
a = np.linspace(0,5,10)
a
b= np.arange(5,11)
b
e = np.concatenate((a, b))
e

array([ 0.        ,  0.55555556,  1.11111111,  1.66666667,  2.22222222,
        2.77777778,  3.33333333,  3.88888889,  4.44444444,  5.        ,
        5.        ,  6.        ,  7.        ,  8.        ,  9.        ,
       10.        ])

### Exercise 5

Given the following array, find the cumulative sum along the rows. Then find the cumulative sum along the columns. Then output the 2nd (1st index) column but only the first 10 rows. You should get a very recognizable pattern.

In [203]:
a = np.array([[0,1,2,3,4,5,6,7,8,9,10],[1,2,3,4,5,6,7,8,9,10,0], [2,3,4,5,6,7,8,9,10,0,1], [3,4,5,6,7,8,9,10,0,1,2],[4,5,6,7,8,9,10,0,1,2,3],[5,6,7,8,9,10,0,1,2,3,4],[6,7,8,9,10,0,1,2,3,4,5],[7,8,9,10,0,1,2,3,4,5,6],[8,9,10,0,1,2,3,4,5,6,7],[9,10,0,1,2,3,4,5,6,7,8],[10,0,1,2,3,4,5,6,7,8,9]])

In [204]:
row_sum= np.cumsum(a, axis=0)
row_sum

array([[ 0,  1,  2,  3,  4,  5,  6,  7,  8,  9, 10],
       [ 1,  3,  5,  7,  9, 11, 13, 15, 17, 19, 10],
       [ 3,  6,  9, 12, 15, 18, 21, 24, 27, 19, 11],
       [ 6, 10, 14, 18, 22, 26, 30, 34, 27, 20, 13],
       [10, 15, 20, 25, 30, 35, 40, 34, 28, 22, 16],
       [15, 21, 27, 33, 39, 45, 40, 35, 30, 25, 20],
       [21, 28, 35, 42, 49, 45, 41, 37, 33, 29, 25],
       [28, 36, 44, 52, 49, 46, 43, 40, 37, 34, 31],
       [36, 45, 54, 52, 50, 48, 46, 44, 42, 40, 38],
       [45, 55, 54, 53, 52, 51, 50, 49, 48, 47, 46],
       [55, 55, 55, 55, 55, 55, 55, 55, 55, 55, 55]], dtype=int32)

In [205]:
sum_col = np.cumsum(row_sum, axis=1)
sum_col

array([[  0,   1,   3,   6,  10,  15,  21,  28,  36,  45,  55],
       [  1,   4,   9,  16,  25,  36,  49,  64,  81, 100, 110],
       [  3,   9,  18,  30,  45,  63,  84, 108, 135, 154, 165],
       [  6,  16,  30,  48,  70,  96, 126, 160, 187, 207, 220],
       [ 10,  25,  45,  70, 100, 135, 175, 209, 237, 259, 275],
       [ 15,  36,  63,  96, 135, 180, 220, 255, 285, 310, 330],
       [ 21,  49,  84, 126, 175, 220, 261, 298, 331, 360, 385],
       [ 28,  64, 108, 160, 209, 255, 298, 338, 375, 409, 440],
       [ 36,  81, 135, 187, 237, 285, 331, 375, 417, 457, 495],
       [ 45, 100, 154, 207, 259, 310, 360, 409, 457, 504, 550],
       [ 55, 110, 165, 220, 275, 330, 385, 440, 495, 550, 605]],
      dtype=int32)

In [206]:
sum_col[:-1,1]   #only first 10 rows(:-1), 2nd column (index 1)

array([  1,   4,   9,  16,  25,  36,  49,  64,  81, 100], dtype=int32)

### Exercise 6

Create a dataframe using the following:

In [119]:
lst = [['Red',4],['Blue',6],['Green',1],\
       ['Yellow',5],['White',3],['Black',2],]

In [207]:
df1 = pd.DataFrame(lst,columns= ["color", "count"]) 
df1

    color  count
0     Red      4
1    Blue      6
2   Green      1
3  Yellow      5
4   White      3
5   Black      2

Create a dataframe using the following:

In [114]:
dct = {'red':4, 'blue':6, 'green':1,\
       'yellow':5, 'white':3, 'black':2 }

In [208]:
df2 = pd.DataFrame(dct.items(), columns= ["color","amount"]) 
df2

    color  amount
0     red       4
1    blue       6
2   green       1
3  yellow       5
4   white       3
5   black       2

**The following exercises will use the dataset imported below:**

In [175]:
df = pd.DataFrame([[2019,'Toyota','Camry',336978, 24765,np.nan],[np.NaN,'Toyota','Corolla',304850, np.nan,4560556],[2019,np.nan,'Supra',2884, 35545,np.nan],[2019,'Toyota','Avalon',27767 ,np.nan,1012940.16]])
df.columns = ['year', 'make', 'model', 'number sold', 'price', 'revenue (in thousands)']
df

     year    make    model  number sold    price  revenue (in thousands)
0  2019.0  Toyota    Camry       336978  24765.0                     NaN
1     NaN  Toyota  Corolla       304850      NaN              4560556.00
2  2019.0     NaN    Supra         2884  35545.0                     NaN
3  2019.0  Toyota   Avalon        27767      NaN              1012940.16

### Exercise 7

a. Fix the `year` column in the dataframe by replacing missing values with the average value of that column.

In [176]:
df['year'].mean()

2019.0

In [177]:
df["year"].fillna(value=df['year'].mean(), inplace=True)
df

     year    make    model  number sold    price  revenue (in thousands)
0  2019.0  Toyota    Camry       336978  24765.0                     NaN
1  2019.0  Toyota  Corolla       304850      NaN              4560556.00
2  2019.0     NaN    Supra         2884  35545.0                     NaN
3  2019.0  Toyota   Avalon        27767      NaN              1012940.16

In [209]:
df["year"] = df["year"].astype('int32')
df

   year    make    model  number sold    price  revenue (in thousands)
0  2019  Toyota    Camry     336978.0  24765.0            8.345260e+15
1  2019  Toyota  Corolla     304850.0      NaN                     NaN
2  2019     NaN    Supra       2884.0  35545.0            1.025118e+14
3  2019  Toyota   Avalon      27767.0      NaN                     NaN


b. Fix the `'make'` column by replacing the missing value with the value that occurred most frequently (mode).

In [187]:
df["make"].mode()

0    Toyota
dtype: object

In [210]:
df["make"] = df["make"].fillna(df["make"].mode()[0])

In [211]:
df

   year    make    model  number sold    price  revenue (in thousands)
0  2019  Toyota    Camry     336978.0  24765.0            8.345260e+15
1  2019  Toyota  Corolla     304850.0      NaN                     NaN
2  2019  Toyota    Supra       2884.0  35545.0            1.025118e+14
3  2019  Toyota   Avalon      27767.0      NaN                     NaN

**note: for the following exercises, remember that revenue in the dataframe is the revenue divided by 1000 (so multiply by 1000 to get true revenue).**

### Exercise 8

Fix the `'revenue (in thousands)'` column by calculating the approximate revenue. Remember that the value of `'revenue'` is in the 1000s.

$$ \textrm{revenue} = \textrm{number sold} * \textrm{price} $$

In [212]:
df["revenue (in thousands)"] = df["revenue (in thousands)"].fillna((df["number sold"]*df["price"])/1000)
df

   year    make    model  number sold    price  revenue (in thousands)
0  2019  Toyota    Camry     336978.0  24765.0            8.345260e+15
1  2019  Toyota  Corolla     304850.0      NaN                     NaN
2  2019  Toyota    Supra       2884.0  35545.0            1.025118e+14
3  2019  Toyota   Avalon      27767.0      NaN                     NaN

In [194]:
df["revenue (in thousands)"] = df["revenue (in thousands)"] * 1000

In [195]:
df

     year    make    model  number sold    price  revenue (in thousands)
0  2019.0  Toyota    Camry       336978  24765.0            8.345260e+15
1  2019.0  Toyota  Corolla       304850      NaN                     NaN
2  2019.0     NaN    Supra         2884  35545.0            1.025118e+14
3  2019.0  Toyota   Avalon        27767      NaN                     NaN

### Exercise 9

Fix the `'price'` column by calculating the approximate price.

$$ \textrm{price} = \frac{\textrm{revenue}}{\textrm{number sold}} $$

In [213]:
df["price"] = df["price"].fillna((df["revenue (in thousands)"]*1000) / df["number sold"])
df

   year    make    model  number sold    price  revenue (in thousands)
0  2019  Toyota    Camry     336978.0  24765.0            8.345260e+15
1  2019  Toyota  Corolla     304850.0      NaN                     NaN
2  2019  Toyota    Supra       2884.0  35545.0            1.025118e+14
3  2019  Toyota   Avalon      27767.0      NaN                     NaN

### Exercise 10

Fix the `'number sold'` column by calculating the approximate number of vehicles sold.

$$ \textrm{number sold} = \frac{\textrm{revenue}}{\textrm{price}} $$

In [214]:
df['number sold']= df['number sold'].fillna((df['revenue (in thousands)']*1000) / df['price'])
df

# df.loc[df["number sold"].isnull(), 'number sold'] = df["revenue (in thousands)"] / df['price']
# df

   year    make    model  number sold    price  revenue (in thousands)
0  2019  Toyota    Camry     336978.0  24765.0            8.345260e+15
1  2019  Toyota  Corolla     304850.0      NaN                     NaN
2  2019  Toyota    Supra       2884.0  35545.0            1.025118e+14
3  2019  Toyota   Avalon      27767.0      NaN                     NaN

# Machine Learning Questions 

Answer 5 out of 10.

**1. What is bias in a machine learning model? Why does increasing model complexity decrease bias? What concerns do we need to worry about when increasing model complexity to decrease bias?**

Bias is the ML model's ability to learn the same thing incorrectly. If your ML model isn't able to pick up on signals effectively - then it's bias. Inscreasing model complexity decreases bias, we provide more info so we provide more features the model can respond to, pick up on signals and learn/perform better. However, If we add too many features we can run into oposite issue - we are adding signals but also adding noise - which causes variance in our model's output. By adding too many features we may add errors to our model due to that. We need to find the swett spot where we give our model enough info to pick up on signals but not to pick up on noise.

**2. What do we use a logistic regression for? What class of machine learning algorithms is logistic regression part of? Explain the main difference between this class of machine learning algorithm and alternatives.**

We use Logistic Regression to put data in one of 2 categories, basically we are able to perform binary classification on data and predict in which of the 2 categories it'll fall. In order to perform logistic regression, the independent and dependent variables have to have a linear relationship. So, basically we use the linear regression and map it to the only 2 values on the Y axis.
Logistic regression is part of Supervised ML.
Supervised vs unsupervised ML difference - Unsupervised is a type of machine learning that uses unlabeled data. Because our data doesn't have the correctly labeled output, unsupervised machine learning algorithms can't rely on the "correct answers" to gauge its performance.So many unsupervised machine learning algorithms rely on discovering hidden patterns. In Superviced ML we try to maxinize the similarities. Supervised ML is a type of machine learning that involves the use of labeled data. Most supervised machine learning algorithms work by trying to minimize the errors when processing the data.
There is also Semi-Supervised Machine Learning (utilizes both supervised and unsupervised machine learning algorithms) and Reinforcement Learning (concerned with how intelligent agents ought to take actions in an environment in order to maximize the notion of cumulative reward.).

**3. Explain A/B testing. In what circumstances can you use it?**

The homepage example in class.
Creating 2 versions of a digital asset to see which one users respond to better. Examples of assets include a landing page, display ad, marketing email, and social post. In an A/B test, half of your audience automatically receives “version A” and half receives “version B” - which is the new/changed version. The performance of each version is based on conversion rate goals such as the percentage of people who click on a link, complete a form, or make a purchase. You can then determine whether changing the experience (from A to B) had a positive, negative, or no effect on visitor behavior.

**4. Explain what True Positive, False Positive, True Negative and False Negative means in the context of a classification model (these are the outputs of a confusion matrix).**

If we refer to the pictures of dogs example rom class:   
TP - is when the classification model classified something as something and that it really was, the model said it was a dog and it was a dog;   
FP - says that it was a dog but it was not a dog;    
TN- the model said it was not a dog and it was not a dog;   
FN - model says it is not a dog but it actually is a dog

**5. Explain the difference between overfitting and underfitting.**

Overfitting and Underfitting are the two main problems that occur in machine learning and degrade the performance of the machine learning models. Overfitting occurs when our machine learning model tries to cover all the data points or more than the required data points present in the given dataset. Because of this, the model starts catching noise and inaccurate values present in the dataset, and all these factors reduce the efficiency and accuracy of the model. The overfitted model has low bias and high variance. The more we train our model, the more chances of occurring the overfitted model. Overfitting is the main problem that occurs in supervised learning. How to avoid the Overfitting in Model: Cross-Validation, Training with more data, Removing features, Early stopping the training, Regularization, Ensembling.   

Underfitting occurs when our machine learning model is not able to capture the underlying trend of the data. In the case of underfitting, the model is not able to learn enough from the training data, and hence it reduces the accuracy and produces unreliable predictions.
An underfitted model has high bias and low variance. How to avoid underfitting: By increasing the training time of the model, By increasing the number of features.

**6. How do you select the number of clusters for a clustering algorithm?**

These methods include direct methods and statistical testing methods:
Direct methods: consists of optimizing a criterion, such as the within cluster sums of squares or the average silhouette. The corresponding methods are named elbow and silhouette methods, respectively.
Statistical testing methods: consists of comparing evidence against null hypothesis. An example is the gap statistic.   
Elbow method - for k-means clustering, we run the algorhithm for different values of K and we compare it to see what the inertia is. When the inertia stops to drop that's probably the optimal number of clusters.

**7. Explain what a perceptron is and how it works.**

A Perceptron is an algorithm for supervised learning of binary classifiers. This algorithm enables neurons to learn and processes elements in the training set one at a time.
There are two types of Perceptrons: Single layer and Multilayer. Single layer Perceptrons can learn only linearly separable patterns. Multilayer Perceptrons or feedforward neural networks with two or more layers have the greater processing power.

The Perceptron algorithm learns the weights for the input signals in order to draw a linear decision boundary. This enables you to distinguish between the two linearly separable classes +1 and -1.

**8. Explain why we would want to use dimensionality reduction. Use Principal Component Analysis in your response.**

**9. Explain how supervised machine learning works.**

A supervised ML model is prepared through a training process in which it is required to make predictions and it is corrected when those predictions are wrong.

Input data is called training data and has a known label or result such as spam/not-spam or a stock price at a time.

The training process continues until the model achieves a desired level of accuracy on the training data.

Example problems: Classification and Regression.

**10. Explain why we split our data into training and testing data for supervised machine learning.**